package com.leetcode.exer2;

/**
 * 问题描述
 * 本题为填空题，只需要算出结果后，在代码中使用输出语句将所填结果输出即可。
 *
 * 灭鼠先锋是一个老少咸宜的棋盘小游戏，由两人参与，轮流操作。
 *
 * 灭鼠先锋的棋盘有各种规格，本题中游戏在两行四列的棋盘上进行。游戏的规则为：两人轮流操作，
 * 每次可选择在棋盘的一个空位上放置一个棋子，或在同一行的连续两个空位上各放置一个棋子，放下棋子后使棋盘放满的一方输掉游戏。
 *
 * 小蓝和小乔一起玩游戏，小蓝先手，小乔后手。小蓝可以放置棋子的方法很多，通过旋转和翻转可以对应如下四种情况：
 *
 * XOOO XXOO OXOO OXXO
 * OOOO OOOO OOOO OOOO
 * 其中 O 表示棋盘上的一个方格为空，X 表示该方格已经放置了棋子。
 *
 * 请问，对于以上四种情况，如果小蓝和小乔都是按照对自己最优的策略来玩游戏，小蓝是否能获胜。如果获胜，请用 V 表示，否则用 L 表示。请将四种情况的胜负结果按顺序连接在一起提交。
 * @author hugaojun Email:nat17185546@163.com
 * @create 2023-02-19-[下午 3:22]-周日
 */
public class No2022_RodentControlPioneer {
    public static void main(String[] args) {
        System.out.print("LLLV");
    }
}
